//***************************************************
/** 21/3/8
 * P256「オブジェクトの配列とコンストラクタ呼び出し」
*/
//***************************************************

#include <iostream>
#include "c.hpp"

int main(void)
{
    A a1("pochi", 15);
    a1.show(); //pochi 15

    std::cout << "------------------------------------" << std::endl;

    A a[4] = {
        A{"first", 42}, //一つ目コンストラクタ呼び出し
        A{"second"},    //2つ目コンストラクタ呼び出し
        //3つ目以降～デフォルトコンストラクタ自動呼出し
        //main.cpp 23行目→19行目
    };

    a[0].show();
    a[1].show();
    a[2].show();
    a[3].show();

    return 0;
}